Tekla.Structures.Plugins.PropertyPane.Single
The single property enum.

Tekla.Structures.Plugins.PropertyPane.Single.None
The None.

Tekla.Structures.Plugins.PropertyPane.Single.String
The string.

Tekla.Structures.Plugins.PropertyPane.Single.Double
The double.

Tekla.Structures.Plugins.PropertyPane.Single.Integer
The integer.

Tekla.Structures.Plugins.PropertyPane.Single.Boolean
The boolean.

Tekla.Structures.Plugins.PropertyPane.Single.Angle
The angle.

Tekla.Structures.Plugins.PropertyPane.Single.Distance
The distance.

Tekla.Structures.Plugins.PropertyPane.Single.DateTime
The datetime.

Tekla.Structures.Plugins.PropertyPane.Single.DistanceList
The distance list.

Tekla.Structures.Plugins.PropertyPane.Single.Mass
The mass.

Tekla.Structures.Plugins.PropertyPane.Single.Area
The area.

Tekla.Structures.Plugins.PropertyPane.Single.Percent
The percent.